'use strict'

/*const text = '#';

for (let i = 0; i <= 7; i++) {
	console.log(text.repeat(i));
};*/

// Когда это заработает, измените программу так, чтобы она печатала "FizzBuzz"
// для чисел, которые делятся и на 3, и на 5 (и по-прежнему печатайте "Fizz"
// или "Buzz" для чисел, кратных только одному из них).

/*for (let i = 1; i <= 100; i++) {
	if ((+i % 5 == 0) && (+i % 3 == 0)) {
		console.log('FizzBuzz');
	} else if (+i % 3 == 0) {
		console.log('Fizz');
	} else if (+i % 5 == 0) {
		console.log('Buzz');
	} else {
		console.log(i);
	};
}*/

// Напишите программу, которая создает строку, представляющую сетку 8 х 8,
// используя для разделения строк символы новой строки. В каждой позиции
// сетки стоит либо пробел, либо символ"#". Эти символы должны располагаться
// в шахматном порядке.
// Передавая данную строку в console. log, вы должны получить что-то вроде
// этого:
// # # # #
//  # # # #
// # # # #
//  # # # #
// # # # #
//  # # # #
// # # # #

// let size = 8,
// 	chess = ('# ').repeat(size/2) + '\n' + ((' #').repeat(size/2) + '\n');

// console.log(chess.repeat(size/2));
	